//Во всех заданиях данной подгруппы предполагается, что исходные строки, определяющие выражения, 
//не содержат пробелов.При выполнении заданий не следует использовать оператор цикла.
//Вывести значение целочисленного выражения, заданного в виде строки S.Выражение
//определяется следующим образом :
//<выражение> :: = <цифра> | (<выражение><знак><выражение>)
//< знак > :: = +| − | *

// FIX_ME: программа должна быть разделена на модули (заголовочный файл .h и файл реализации .cpp)

#include "Task4.h"
#include <iostream>
#include <string>

// FIX_ME: using namespace std в глобальной области видимости
// using namespace std;

//FIX_ME: фигурная скобка должна быть на новой строке
//int main() {
int main()
{
    setlocale(0, "");
    // FIX_ME: добавить std::
    // FIX_ME: имя переменной должно быть информативным и начинаться с заглавной буквы
    //string s;
    std::string Expression;
    // FIX_ME: добавить std::
    // FIX_ME: имя функции  и имя переменной обновлены
    //cout << "Введите строку вида - <цифра> | (<выражение><знак><выражение>), где знак - (+ | - | *):" << endl;
    //cin >> s;
    //cout << "Результат: " << Calc(s) << endl;
    std::cout << "Введите строку вида - <цифра> | (<выражение><знак><выражение>), где знак - (+ | - | *):" << std::endl;
    std::cin >> Expression;
    std::cout << "Результат: " << CalculateExpression(Expression) << std::endl;
    return 0;
}